In [22]:
import pandas as pd
import numpy as np

In [23]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [24]:
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [ ]:
1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [25]:
df['FlightNumber'] = df['FlightNumber'].interpolate().astype(int)
df['FlightNumber']

0    10045
1    10055
2    10065
3    10075
4    10085
Name: FlightNumber, dtype: int64

In [26]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [ ]:
2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [27]:
temp=df["From_To"].str.split('_',expand=True)
temp.columns=['From','To']
temp

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [ ]:
 # Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [31]:
temp.From=temp.From.str.capitalize()

In [32]:
temp.To=temp.To.str.capitalize()

In [33]:
temp

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

In [ ]:
Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

In [34]:
  df=df.drop('From_To',axis=1)

In [35]:
df

   FlightNumber  RecentDelays              Airline
0         10045      [23, 47]               KLM(!)
1         10055            []    <Air France> (12)
2         10065  [24, 43, 87]  (British Airways. )
3         10075          [13]       12. Air France
4         10085      [67, 32]          "Swiss Air"

In [37]:
df=df.join(temp)

In [38]:
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

In [42]:
df3=pd.DataFrame(df['RecentDelays'].values.tolist())

In [47]:
df3

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [50]:
length_col=df3.shape[1]
length_col

3

In [53]:
df3.columns[0]

0

In [61]:
col_list=[]
col_dict={}
for i in range(length_col):
  key=df3.columns[i]
  Value="Delay" + str(i+1)
  col_dict[key]=Value
  
col_dict

{0: 'Delay1', 1: 'Delay2', 2: 'Delay3'}

In [62]:
df3.rename(columns=col_dict,inplace=True)

In [63]:
df3

   Delay1  Delay2  Delay3
0    23.0    47.0     NaN
1     NaN     NaN     NaN
2    24.0    43.0    87.0
3    13.0     NaN     NaN
4    67.0    32.0     NaN

In [64]:
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

In [65]:
df[["Delay1","Delay2","Delay3"]]=df3[["Delay1","Delay2","Delay3"]]

In [66]:
df

   FlightNumber  RecentDelays              Airline  ... Delay1 Delay2  Delay3
0         10045      [23, 47]               KLM(!)  ...   23.0   47.0     NaN
1         10055            []    <Air France> (12)  ...    NaN    NaN     NaN
2         10065  [24, 43, 87]  (British Airways. )  ...   24.0   43.0    87.0
3         10075          [13]       12. Air France  ...   13.0    NaN     NaN
4         10085      [67, 32]          "Swiss Air"  ...   67.0   32.0     NaN

[5 rows x 8 columns]

In [69]:
df.drop('RecentDelays',axis=1,inplace=True)

In [70]:
df

   FlightNumber              Airline      From  ... Delay1  Delay2  Delay3
0         10045               KLM(!)    London  ...   23.0    47.0     NaN
1         10055    <Air France> (12)    Madrid  ...    NaN     NaN     NaN
2         10065  (British Airways. )    London  ...   24.0    43.0    87.0
3         10075       12. Air France  Budapest  ...   13.0     NaN     NaN
4         10085          "Swiss Air"  Brussels  ...   67.0    32.0     NaN

[5 rows x 7 columns]